OpenNuvoton/M480BSP/Library/USB_Host/src_core/driver.c
/*
 * drivers/usb/driver.c - most of the driver model stuff for usb
 *
 * (C) Copyright 2005 Greg Kroah-Hartman <gregkh@suse.de>
 *
 * based on drivers/usb/usb.c which had the following copyrights:
 *  (C) Copyright Linus Torvalds 1999
 *  (C) Copyright Johannes Erdfelt 1999-2001
 *  (C) Copyright Andreas Gal 1999
 *  (C) Copyright Gregory P. Smith 1999
 *  (C) Copyright Deti Fliegl 1999 (new USB architecture)
 *  (C) Copyright Randy Dunlap 2000
 *  (C) Copyright David Brownell 2000-2004
 *  (C) Copyright Yggdrasil Computing, Inc. 2000
 *      (usb_device_id matching changes by Adam J. Richter)
 *  (C) Copyright Greg Kroah-Hartman 2002-2003
 *
 * NOTE! This is not actually a driver at all, rather this is
 * just a collection of helper routines that implement the
 * matching, probing, releasing, suspending and resuming for
 * real drivers.
 *
 */

/**************************************************************************//**
 * @file     driver.c
 * @version  V1.10
 * $Revision: 11 $
 * $Date: 14/10/03 1:54p $
 * @brief  Ported from Linux USB host driver.
 *
 * @note
 * Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "M480.h"

#include "usb.h"

/// @cond HIDDEN_SYMBOLS

#ifdef CONFIG_HOTPLUG

/*
 * Adds a new dynamic USBdevice ID to this driver,
 * and cause the driver to probe for all devices again.
 */
ssize_t usb_store_new_id(struct usb_dynids *dynids,
                         struct device_driver *driver,
                         const char *buf, size_t count)
{
    struct usb_dynid *dynid;
    u32 idVendor = 0;
    u32 idProduct = 0;
    int fields = 0;
    int retval = 0;

    fields = sscanf(buf, "%x %x", &idVendor, &idProduct);
    if (fields < 2)
        return -EINVAL;

    dynid = kzalloc(sizeof(*dynid), GFP_KERNEL);
    if (!dynid)
        return -ENOMEM;

    INIT_LIST_HEAD(&dynid->node);
    dynid->id.idVendor = idVendor;
    dynid->id.idProduct = idProduct;
    dynid->id.match_flags = USB_DEVICE_ID_MATCH_DEVICE;

    spin_lock(&dynids->lock);
    list_add_tail(&dynid->node, &dynids->list);
    spin_unlock(&dynids->lock);

    if (get_driver(driver)) {
        retval = driver_attach(driver);
        put_driver(driver);
    }

    if (retval)
        return retval;
    return count;
}

static ssize_t store_new_id(struct device_driver *driver,
                            const char *buf, size_t count)
{
    struct usb_driver *usb_drv

    usb_drv = to_usb_driver_by_devdrv(driver);  // to_usb_driver(driver);

    return usb_store_new_id(&usb_drv->dynids, driver, buf, count);
}
static DRIVER_ATTR(new_id, S_IWUSR, NULL, store_new_id);

/**
 * store_remove_id - remove a USB device ID from this driver
 * @driver: target device driver
 * @buf: buffer for scanning device ID data
 * @count: input size
 *
 * Removes a dynamic usb device ID from this driver.
 */
static ssize_t
store_remove_id(struct device_driver *driver, const char *buf, size_t count)
{
    struct usb_dynid *dynid, *n;
    struct usb_driver *usb_driver;
    u32 idVendor = 0;
    u32 idProduct = 0;
    int fields = 0;
    int retval = 0;

    usb_driver = to_usb_driver_by_devdrv(driver); // to_usb_driver(driver);

    fields = sscanf(buf, "%x %x", &idVendor, &idProduct);
    if (fields < 2)
        return -EINVAL;

    spin_lock(&usb_driver->dynids.lock);
    list_for_each_entry_safe(dynid, n, &usb_driver->dynids.list, node) {
        struct usb_device_id *id = &dynid->id;
        if ((id->idVendor == idVendor) &&
                (id->idProduct == idProduct)) {
            list_del(&dynid->node);
            kfree(dynid);
            retval = 0;
            break;
        }
    }
    spin_unlock(&usb_driver->dynids.lock);

    if (retval)
        return retval;
    return count;
}
static DRIVER_ATTR(remove_id, S_IWUSR, NULL, store_remove_id);

static int usb_create_newid_file(struct usb_driver *usb_drv)
{
    int error = 0;

    if (usb_drv->no_dynamic_id)
        goto exit;

    if (usb_drv->probe != NULL)
        error = driver_create_file(&usb_drv->drvwrap.driver,
                                   &driver_attr_new_id);
exit:
    return error;
}

static void usb_remove_newid_file(struct usb_driver *usb_drv)
{
    if (usb_drv->no_dynamic_id)
        return;

    if (usb_drv->probe != NULL)
        driver_remove_file(&usb_drv->drvwrap.driver,
                           &driver_attr_new_id);
}

static int
usb_create_removeid_file(struct usb_driver *drv)
{
    int error = 0;
    if (drv->probe != NULL)
        error = driver_create_file(&drv->drvwrap.driver,
                                   &driver_attr_remove_id);
    return error;
}

static void usb_remove_removeid_file(struct usb_driver *drv)
{
    driver_remove_file(&drv->drvwrap.driver, &driver_attr_remove_id);
}

static void usb_free_dynids(struct usb_driver *usb_drv)
{
    struct usb_dynid *dynid, *n;

    spin_lock(&usb_drv->dynids.lock);
    list_for_each_entry_safe(dynid, n, &usb_drv->dynids.list, node) {
        list_del(&dynid->node);
        kfree(dynid);
    }
    spin_unlock(&usb_drv->dynids.lock);
}
#else

//static inline int usb_create_newid_file(struct usb_driver *usb_drv)
//{
//  return 0;
//}

//static void usb_remove_newid_file(struct usb_driver *usb_drv)
//{
//}

//static int
//usb_create_removeid_file(struct usb_driver *drv)
//{
//  return 0;
//}

//static void usb_remove_removeid_file(struct usb_driver *drv)
//{
//}

static inline void usb_free_dynids(struct usb_driver *usb_drv)
{
}
#endif

static const struct usb_device_id *usb_match_dynamic_id(struct usb_interface *intf,
        struct usb_driver *drv)
{
    struct usb_dynid *dynid;

    spin_lock(&drv->dynids.lock);
#if 0
    list_for_each_entry(dynid, &drv->dynids.list, node) {
#else
    for (dynid = list_entry((&drv->dynids.list)->next, struct usb_dynid, node);
            &dynid->node != (&drv->dynids.list);
            dynid = list_entry(dynid->node.next, struct usb_dynid, node)) {
#endif
        if (usb_match_one_id(intf, &dynid->id)) {
            spin_unlock(&drv->dynids.lock);
            return &dynid->id;
        }
    }
    spin_unlock(&drv->dynids.lock);
    return NULL;
}


