OpenNuvoton/M480BSP/Library/USB_Host/src_core/driver.c
#if 0
/* called from driver core with dev locked */
static int usb_probe_device(struct device *dev)
{
    struct usb_device_driver *udriver;
    struct usb_device *udev;
    int error = 0;

    udriver = to_usb_device_driver_by_devdrv(dev->driver);  // to_usb_device_driver(dev->driver);
    udev = to_usb_device_by_dev(dev);  // to_usb_device(dev);

    USB_debug("%s\n", __func__);

    /* TODO: Add real matching code */

    /* The device should always appear to be in use
     * unless the driver suports autosuspend.
     */
    if (!udriver->supports_autosuspend)
        error = usb_autoresume_device(udev);

    if (!error)
        error = udriver->probe(udev);
    return error;
}
#endif

#if 0
/* called from driver core with dev locked */
static int usb_unbind_device(struct device *dev)
{
    struct usb_device *udev;
    struct usb_device_driver *udriver;

    udev = to_usb_device_by_dev(dev);   // to_usb_device(dev);
    udriver = to_usb_device_driver_by_devdrv(dev->driver);  // to_usb_device_driver(dev->driver);

    udriver->disconnect(udev);
    if (!udriver->supports_autosuspend)
        usb_autosuspend_device(udev);
    return 0;
}
#endif

/*
 * Cancel any pending scheduled resets
 *
 * [see usb_queue_reset_device()]
 *
 * Called after unconfiguring / when releasing interfaces. See
 * comments in __usb_queue_reset_device() regarding
 * udev->reset_running.
 */
#if 0
static void usb_cancel_queued_reset(struct usb_interface *iface)
{
    if (iface->reset_running == 0)
        cancel_work_sync(&iface->reset_ws);
}
#endif

/* called from driver core with dev locked */
static int usb_probe_interface(struct device *dev)
{
    struct usb_driver *driver;
    struct usb_interface *intf;
    struct usb_device *udev;
    const struct usb_device_id *id;
    int error = -ENODEV;

    driver = to_usb_driver_by_devdrv(dev->driver); // to_usb_driver(dev->driver);
    intf = to_usb_interface_by_dev(dev);  // to_usb_interface(dev);
    udev = interface_to_usbdev(intf);

    intf->needs_binding = 0;

    if (usb_device_is_owned(udev))
        return error;

    //if (udev->authorized == 0) {
    //  USB_error("Device is not authorized for usage\n");
    //  return error;
    //}

    id = usb_match_id(intf, driver->id_table);
    if (!id)
        id = usb_match_dynamic_id(intf, driver);
    if (!id)
        return error;

    error = usb_autoresume_device(udev);
    if (error)
        return error;

    intf->condition = USB_INTERFACE_BINDING;

    /* Probed interfaces are initially active.  They are
     * runtime-PM-enabled only if the driver has autosuspend support.
     * They are sensitive to their children's power states.
     */
    //pm_runtime_set_active(dev);
    //pm_suspend_ignore_children(dev, false);
    //if (driver->supports_autosuspend)
    //  pm_runtime_enable(dev);

    /* Carry out a deferred switch to altsetting 0 */
    if (intf->needs_altsetting0) {
        error = usb_set_interface(udev, intf->altsetting[0].
                                  desc.bInterfaceNumber, 0);
        if (error < 0)
            goto err;
        intf->needs_altsetting0 = 0;
    }

    error = driver->probe(intf, id);
    if (error)
        goto err;

    intf->condition = USB_INTERFACE_BOUND;
    usb_autosuspend_device(udev);
    return error;

err:
    intf->needs_remote_wakeup = 0;
    intf->condition = USB_INTERFACE_UNBOUND;
    //usb_cancel_queued_reset(intf);

    /* Unbound interfaces are always runtime-PM-disabled and -suspended */
    //if (driver->supports_autosuspend)
    //  pm_runtime_disable(dev);
    //pm_runtime_set_suspended(dev);

    usb_autosuspend_device(udev);
    return error;
}

/* called from driver core with dev locked */
static int usb_unbind_interface(struct device *dev)
{
    struct usb_driver *driver;
    struct usb_interface *intf;
    struct usb_device *udev;
    int error, r;

    driver = to_usb_driver_by_devdrv(dev->driver);  // to_usb_driver(dev->driver);
    intf = to_usb_interface_by_dev(dev);  // to_usb_interface(dev);

    intf->condition = USB_INTERFACE_UNBINDING;

    /* Autoresume for set_interface call below */
    udev = interface_to_usbdev(intf);
    error = usb_autoresume_device(udev);

    /* Terminate all URBs for this interface unless the driver
     * supports "soft" unbinding.
     */
    //if (!driver->soft_unbind)
    usb_disable_interface(udev, intf, false);

    driver->disconnect(intf);
    //usb_cancel_queued_reset(intf);

    /* Reset other interface state.
     * We cannot do a Set-Interface if the device is suspended or
     * if it is prepared for a system sleep (since installing a new
     * altsetting means creating new endpoint device entries).
     * When either of these happens, defer the Set-Interface.
     */
    if (intf->cur_altsetting->desc.bAlternateSetting == 0) {
        /* Already in altsetting 0 so skip Set-Interface.
         * Just re-enable it without affecting the endpoint toggles.
         */
        usb_enable_interface(udev, intf, false);
        // } else if (!error && !intf->dev.power.is_prepared) {
    } else if (!error) {
        r = usb_set_interface(udev, intf->altsetting[0].
                              desc.bInterfaceNumber, 0);
        if (r < 0)
            intf->needs_altsetting0 = 1;
    } else {
        intf->needs_altsetting0 = 1;
    }
    usb_set_intfdata(intf, NULL);

    intf->condition = USB_INTERFACE_UNBOUND;
    intf->needs_remote_wakeup = 0;

    /* Unbound interfaces are always runtime-PM-disabled and -suspended */
    //if (driver->supports_autosuspend)
    //  pm_runtime_disable(dev);
    //pm_runtime_set_suspended(dev);

    /* Undo any residual pm_autopm_get_interface_* calls */
    //for (r = atomic_read(&intf->pm_usage_cnt); r > 0; --r)
    //  usb_autopm_put_interface_no_suspend(intf);
    //atomic_set(&intf->pm_usage_cnt, 0);

    if (!error)
        usb_autosuspend_device(udev);

    return 0;
}

/**
 * usb_driver_claim_interface - bind a driver to an interface
 * @driver: the driver to be bound
 * @iface: the interface to which it will be bound; must be in the
 *  usb device's active configuration
 * @priv: driver data associated with that interface
 *
 * This is used by usb device drivers that need to claim more than one
 * interface on a device when probing (audio and acm are current examples).
 * No device driver should directly modify internal usb_interface or
 * usb_device structure members.
 *
 * Few drivers should need to use this routine, since the most natural
 * way to bind to an interface is to return the private data from
 * the driver's probe() method.
 *
 * Callers must own the device lock, so driver probe() entries don't need
 * extra locking, but other call contexts may need to explicitly claim that
 * lock.
 */
int usb_driver_claim_interface(struct usb_driver *driver,
                               struct usb_interface *iface, void *priv)
{
    struct device *dev;
    int retval = 0;

    dev = &iface->dev;

    if (dev->driver)
        return -EBUSY;

    dev->driver = &driver->drvwrap.driver;
    usb_set_intfdata(iface, priv);
    iface->needs_binding = 0;

    iface->condition = USB_INTERFACE_BOUND;

    /* Claimed interfaces are initially inactive (suspended) and
     * runtime-PM-enabled, but only if the driver has autosuspend
     * support.  Otherwise they are marked active, to prevent the
     * device from being autosuspended, but left disabled.  In either
     * case they are sensitive to their children's power states.
     */
    //pm_suspend_ignore_children(dev, false);
    //if (driver->supports_autosuspend)
    //  pm_runtime_enable(dev);
    //else
    //  pm_runtime_set_active(dev);

    /* if interface was already added, bind now; else let
     * the future device_add() bind it, bypassing probe()
     */
    //if (device_is_registered(dev))
    //  retval = device_bind_driver(dev);

    return retval;
}

/**
 * usb_driver_release_interface - unbind a driver from an interface
 * @driver: the driver to be unbound
 * @iface: the interface from which it will be unbound
 *
 * This can be used by drivers to release an interface without waiting
 * for their disconnect() methods to be called.  In typical cases this
 * also causes the driver disconnect() method to be called.
 *
 * This call is synchronous, and may not be used in an interrupt context.
 * Callers must own the device lock, so driver disconnect() entries don't
 * need extra locking, but other call contexts may need to explicitly claim
 * that lock.
 */
void usb_driver_release_interface(struct usb_driver *driver,
                                  struct usb_interface *iface)
{
    struct device *dev;

    dev = &iface->dev;

