OpenNuvoton/M480BSP/Library/USB_Host/src_core/driver.c
    return NULL;
}

static int usb_device_match(struct device *dev, struct device_driver *drv)
{
    /* devices and interfaces are handled separately */
    if (is_usb_device(dev)) {

        /* interface drivers never match devices */
        //if (!is_usb_device_driver(drv))
        //  return 0;

        /* TODO: Add real matching code */
        return 1;

    } else if (is_usb_interface(dev)) {
        struct usb_interface *intf;
        struct usb_driver *usb_drv;
        const struct usb_device_id *id;

        /* device drivers never match interfaces */
        // ???
        //if (is_usb_device_driver(drv))
        //  return 0;

        intf = to_usb_interface_by_dev(dev);  // to_usb_interface(dev);
        usb_drv = to_usb_driver_by_devdrv(drv); // to_usb_driver(drv);

        id = usb_match_id(intf, usb_drv->id_table);
        if (id)
            return 1;

        id = usb_match_dynamic_id(intf, usb_drv);
        if (id)
            return 1;
    }

    return 0;
}

#ifdef  CONFIG_HOTPLUG
static int usb_uevent(struct device *dev, struct kobj_uevent_env *env)
{
    struct usb_device *usb_dev;

    if (is_usb_device(dev)) {
        usb_dev = to_usb_device_by_dev(dev);  // to_usb_device(dev);
    } else if (is_usb_interface(dev)) {
        struct usb_interface *intf = to_usb_interface_by_dev(dev);  // to_usb_interface(dev);

        usb_dev = interface_to_usbdev(intf);
    } else {
        return 0;
    }

    if (usb_dev->devnum < 0) {
        /* driver is often null here; dev_dbg() would oops */
        USB_debug("usb device 0x%x: already deleted?\n", (int)dev);
        return -ENODEV;
    }
    if (!usb_dev->bus) {
        pr_debug("usb %s: bus removed?\n", dev_name(dev));
        return -ENODEV;
    }

#ifdef  CONFIG_USB_DEVICEFS
    /* If this is available, userspace programs can directly read
     * all the device descriptors we don't tell them about.  Or
     * act as usermode drivers.
     */
    if (add_uevent_var(env, "DEVICE=/proc/bus/usb/%03d/%03d",
                       usb_dev->bus->busnum, usb_dev->devnum))
        return -ENOMEM;
#endif

    /* per-device configurations are common */
    if (add_uevent_var(env, "PRODUCT=%x/%x/%x",
                       le16_to_cpu(usb_dev->descriptor.idVendor),
                       le16_to_cpu(usb_dev->descriptor.idProduct),
                       le16_to_cpu(usb_dev->descriptor.bcdDevice)))
        return -ENOMEM;

    /* class-based driver binding models */
    if (add_uevent_var(env, "TYPE=%d/%d/%d",
                       usb_dev->descriptor.bDeviceClass,
                       usb_dev->descriptor.bDeviceSubClass,
                       usb_dev->descriptor.bDeviceProtocol))
        return -ENOMEM;

    return 0;
}

#else

//static int usb_uevent(struct device *dev, struct kobj_uevent_env *env)
//{
//  return -ENODEV;
//}
#endif  /* CONFIG_HOTPLUG */

/**
 * usb_register_device_driver - register a USB device (not interface) driver
 * @new_udriver: USB operations for the device driver
 * @owner: module owner of this driver.
 *
 * Registers a USB device driver with the USB core.  The list of
 * unattached devices will be rescanned whenever a new driver is
 * added, allowing the new driver to attach to any recognized devices.
 * Returns a negative error code on failure and 0 on success.
 */
#if 0
int usb_register_device_driver(struct usb_device_driver *new_udriver,
                               struct module *owner)
{
    int retval = 0;

    if (usb_disabled())
        return -ENODEV;

    new_udriver->drvwrap.for_devices = 1;
    new_udriver->drvwrap.driver.name = (char *) new_udriver->name;
    new_udriver->drvwrap.driver.bus = &usb_bus_type;
    new_udriver->drvwrap.driver.probe = usb_probe_device;
    new_udriver->drvwrap.driver.remove = usb_unbind_device;
    new_udriver->drvwrap.driver.owner = owner;

    retval = driver_register(&new_udriver->drvwrap.driver);

    if (!retval) {
        pr_info("%s: registered new device driver %s\n",
                usbcore_name, new_udriver->name);
        usbfs_update_special();
    } else {
        printk(KERN_ERR "%s: error %d registering device "
               "	driver %s\n",
               usbcore_name, retval, new_udriver->name);
    }

    return retval;
}
#endif

#if 0
/**
 * usb_deregister_device_driver - unregister a USB device (not interface) driver
 * @udriver: USB operations of the device driver to unregister
 * Context: must be able to sleep
 *
 * Unlinks the specified driver from the internal USB driver list.
 */
void usb_deregister_device_driver(struct usb_device_driver *udriver)
{
    pr_info("%s: deregistering device driver %s\n",
            usbcore_name, udriver->name);

    driver_unregister(&udriver->drvwrap.driver);
    usbfs_update_special();
}
#endif

/**
 * usb_register_driver - register a USB interface driver
 * @new_driver: USB operations for the interface driver
 * @owner: module owner of this driver.
 * @mod_name: module name string
 *
 * Registers a USB interface driver with the USB core.  The list of
 * unattached interfaces will be rescanned whenever a new driver is
 * added, allowing the new driver to attach to any recognized interfaces.
 * Returns a negative error code on failure and 0 on success.
 *
 * NOTE: if you want your driver to use the USB major number, you must call
 * usb_register_dev() to enable that functionality.  This function no longer
 * takes care of that.
 */
//int usb_register_driver(struct usb_driver *new_driver, struct module *owner,
//          const char *mod_name)
int usb_register_driver(struct usb_driver *new_driver, const char *mod_name)
{
    int retval = 0;

    USB_debug("usb_register_driver - %s\n", mod_name);

    if (usb_disabled())
        return -ENODEV;
    new_driver->drvwrap.for_devices = 0;
    new_driver->drvwrap.driver.name = (char *) new_driver->name;
    new_driver->drvwrap.driver.bus = &usb_bus_type;
    new_driver->drvwrap.driver.probe = usb_probe_interface;
    new_driver->drvwrap.driver.remove = usb_unbind_interface;
    //new_driver->drvwrap.driver.owner = owner;
    //new_driver->drvwrap.driver.mod_name = mod_name;
    //spin_lock_init(&new_driver->dynids.lock);
    INIT_LIST_HEAD(&new_driver->dynids.list);

