OpenNuvoton/M480BSP/Library/USB_Host/src_core/driver.c
    retval = driver_register(&new_driver->drvwrap.driver);
    if (retval)
        goto out;

    //usbfs_update_special();

    //retval = usb_create_newid_file(new_driver);
    //if (retval)
    //  goto out_newid;

    //retval = usb_create_removeid_file(new_driver);
    //if (retval)
    //  goto out_removeid;

    USB_debug("%s: registered new interface driver %s\n", usbcore_name, new_driver->name);

out:
    return retval;

//out_removeid:
//  usb_remove_newid_file(new_driver);
//out_newid:
    //driver_unregister(&new_driver->drvwrap.driver);

//  USB_error("%s: error %d registering interface driver %s\n",
//          usbcore_name, retval, new_driver->name);
//  goto out;
}

/**
 * usb_deregister - unregister a USB interface driver
 * @driver: USB operations of the interface driver to unregister
 * Context: must be able to sleep
 *
 * Unlinks the specified driver from the internal USB driver list.
 *
 * NOTE: If you called usb_register_dev(), you still need to call
 * usb_deregister_dev() to clean up your driver's allocated minor numbers,
 * this * call will no longer do it for you.
 */
void usb_deregister(struct usb_driver *driver)
{
    USB_debug("%s: deregistering interface driver %s\n",
              usbcore_name, driver->name);

    //usb_remove_removeid_file(driver);
    //usb_remove_newid_file(driver);
    usb_free_dynids(driver);
    //driver_unregister(&driver->drvwrap.driver);

    //usbfs_update_special();
}

/* Forced unbinding of a USB interface driver, either because
 * it doesn't support pre_reset/post_reset/reset_resume or
 * because it doesn't support suspend/resume.
 *
 * The caller must hold @intf's device's lock, but not its pm_mutex
 * and not @intf->dev.sem.
 */
void usb_forced_unbind_intf(struct usb_interface *intf)
{
    struct usb_driver *driver;

    driver = to_usb_driver_by_devdrv(intf->dev.driver);  // to_usb_driver(intf->dev.driver);

    USB_debug("forced unbind\n");
    usb_driver_release_interface(driver, intf);

    /* Mark the interface for later rebinding */
    intf->needs_binding = 1;
}

/* Delayed forced unbinding of a USB interface driver and scan
 * for rebinding.
 *
 * The caller must hold @intf's device's lock, but not its pm_mutex
 * and not @intf->dev.sem.
 *
 * Note: Rebinds will be skipped if a system sleep transition is in
 * progress and the PM "complete" callback hasn't occurred yet.
 */
void usb_rebind_intf(struct usb_interface *intf)
{
    //int rc;

    /* Delayed unbind of an existing driver */
    if (intf->dev.driver) {
        struct usb_driver *driver = to_usb_driver_by_devdrv(intf->dev.driver);  // to_usb_driver(intf->dev.driver);

        USB_debug("forced unbind\n");
        usb_driver_release_interface(driver, intf);
    }

    /* Try to rebind the interface */
    //if (!intf->dev.power.is_prepared) {
    //  intf->needs_binding = 0;
    //  rc = device_attach(&intf->dev);
    //  if (rc < 0)
    //      dev_warn(&intf->dev, "rebind failed: %d\n", rc);
    //}
}


#ifdef CONFIG_PM

#define DO_UNBIND   0
#define DO_REBIND   1

/* Unbind drivers for @udev's interfaces that don't support suspend/resume,
 * or rebind interfaces that have been unbound, according to @action.
 *
 * The caller must hold @udev's device lock.
 */
static void do_unbind_rebind(struct usb_device *udev, int action)
{
    struct usb_host_config  *config;
    int         i;
    struct usb_interface    *intf;
    struct usb_driver   *drv;

    config = udev->actconfig;
    if (config) {
        for (i = 0; i < config->desc.bNumInterfaces; ++i) {
            intf = config->interface[i];
            switch (action) {
            case DO_UNBIND:
                if (intf->dev.driver) {
                    drv = to_usb_driver_by_devdrv(intf->dev.driver);  // to_usb_driver(intf->dev.driver);
                    if (!drv->suspend || !drv->resume)
                        usb_forced_unbind_intf(intf);
                }
                break;
            case DO_REBIND:
                if (intf->needs_binding)
                    usb_rebind_intf(intf);
                break;
            }
        }
    }
}

static int usb_suspend_device(struct usb_device *udev, pm_message_t msg)
{
    struct usb_device_driver    *udriver;
    int             status = 0;

    if (udev->state == USB_STATE_NOTATTACHED ||
            udev->state == USB_STATE_SUSPENDED)
        goto done;

    /* For devices that don't have a driver, we do a generic suspend. */
    if (udev->dev.driver)
        udriver = to_usb_device_driver_by_devdrv(udev->dev.driver);  // to_usb_device_driver(udev->dev.driver);
    else {
        udev->do_remote_wakeup = 0;
        udriver = &usb_generic_driver;
    }
    status = udriver->suspend(udev, msg);

done:
    dev_vdbg(&udev->dev, "%s: status %d\n", __func__, status);
    return status;
}

static int usb_resume_device(struct usb_device *udev, pm_message_t msg)
{
    struct usb_device_driver    *udriver;
    int             status = 0;

    if (udev->state == USB_STATE_NOTATTACHED)
        goto done;

    /* Can't resume it if it doesn't have a driver. */
    if (udev->dev.driver == NULL) {
        status = -ENOTCONN;
        goto done;
    }

    /* Non-root devices on a full/low-speed bus must wait for their
     * companion high-speed root hub, in case a handoff is needed.
     */
    if (!PMSG_IS_AUTO(msg) && udev->parent && udev->bus->hs_companion)
        device_pm_wait_for_dev(&udev->dev,
                               &udev->bus->hs_companion->root_hub->dev);

    if (udev->quirks & USB_QUIRK_RESET_RESUME)
        udev->reset_resume = 1;

    udriver = to_usb_device_driver_by_devdrv(udev->dev.driver); // to_usb_device_driver(udev->dev.driver);
    status = udriver->resume(udev, msg);

done:
    dev_vdbg(&udev->dev, "%s: status %d\n", __func__, status);
    return status;
}

static int usb_suspend_interface(struct usb_device *udev,
                                 struct usb_interface *intf, pm_message_t msg)
{
    struct usb_driver   *driver;
    int         status = 0;

