OpenNuvoton/M480BSP/Library/USB_Host/src_core/driver.c
    if (udev->state == USB_STATE_NOTATTACHED ||
            intf->condition == USB_INTERFACE_UNBOUND)
        goto done;
    driver = to_usb_driver_by_devdrv(intf->dev.driver);  // to_usb_driver(intf->dev.driver);

    if (driver->suspend) {
        status = driver->suspend(intf, msg);
        if (status && !PMSG_IS_AUTO(msg))
            USB_error("%s error %d\n", "suspend", status);
    } else {
        /* Later we will unbind the driver and reprobe */
        intf->needs_binding = 1;
        dev_warn(&intf->dev, "no %s for driver %s?\n",
                 "suspend", driver->name);
    }

done:
    dev_vdbg(&intf->dev, "%s: status %d\n", __func__, status);
    return status;
}

static int usb_resume_interface(struct usb_device *udev,
                                struct usb_interface *intf, pm_message_t msg, int reset_resume)
{
    struct usb_driver   *driver;
    int         status = 0;

    if (udev->state == USB_STATE_NOTATTACHED)
        goto done;

    /* Don't let autoresume interfere with unbinding */
    if (intf->condition == USB_INTERFACE_UNBINDING)
        goto done;

    /* Can't resume it if it doesn't have a driver. */
    if (intf->condition == USB_INTERFACE_UNBOUND) {

        /* Carry out a deferred switch to altsetting 0 */
        if (intf->needs_altsetting0 && !intf->dev.power.is_prepared) {
            usb_set_interface(udev, intf->altsetting[0].
                              desc.bInterfaceNumber, 0);
            intf->needs_altsetting0 = 0;
        }
        goto done;
    }

    /* Don't resume if the interface is marked for rebinding */
    if (intf->needs_binding)
        goto done;
    driver = to_usb_driver_by_devdrv(intf->dev.driver);  // to_usb_driver(intf->dev.driver);

    if (reset_resume) {
        if (driver->reset_resume) {
            status = driver->reset_resume(intf);
            if (status)
                USB_error("%s error %d\n", "reset_resume", status);
        } else {
            intf->needs_binding = 1;
            USB_error("no %s for driver %s?\n", "reset_resume", driver->name);
        }
    } else {
        if (driver->resume) {
            status = driver->resume(intf);
            if (status)
                USB_error("%s error %d\n", "resume", status);
        } else {
            intf->needs_binding = 1;
            dev_warn(&intf->dev, "no %s for driver %s?\n",
                     "resume", driver->name);
        }
    }

done:
    dev_vdbg(&intf->dev, "%s: status %d\n", __func__, status);

    /* Later we will unbind the driver and/or reprobe, if necessary */
    return status;
}

/**
 * usb_suspend_both - suspend a USB device and its interfaces
 * @udev: the usb_device to suspend
 * @msg: Power Management message describing this state transition
 *
 * This is the central routine for suspending USB devices.  It calls the
 * suspend methods for all the interface drivers in @udev and then calls
 * the suspend method for @udev itself.  If an error occurs at any stage,
 * all the interfaces which were suspended are resumed so that they remain
 * in the same state as the device.
 *
 * Autosuspend requests originating from a child device or an interface
 * driver may be made without the protection of @udev's device lock, but
 * all other suspend calls will hold the lock.  Usbcore will insure that
 * method calls do not arrive during bind, unbind, or reset operations.
 * However drivers must be prepared to handle suspend calls arriving at
 * unpredictable times.
 *
 * This routine can run only in process context.
 */
static int usb_suspend_both(struct usb_device *udev, pm_message_t msg)
{
    int         status = 0;
    int         i = 0, n = 0;
    struct usb_interface    *intf;

    if (udev->state == USB_STATE_NOTATTACHED ||
            udev->state == USB_STATE_SUSPENDED)
        goto done;

    /* Suspend all the interfaces and then udev itself */
    if (udev->actconfig) {
        n = udev->actconfig->desc.bNumInterfaces;
        for (i = n - 1; i >= 0; --i) {
            intf = udev->actconfig->interface[i];
            status = usb_suspend_interface(udev, intf, msg);

            /* Ignore errors during system sleep transitions */
            if (!PMSG_IS_AUTO(msg))
                status = 0;
            if (status != 0)
                break;
        }
    }
    if (status == 0) {
        status = usb_suspend_device(udev, msg);

        /* Again, ignore errors during system sleep transitions */
        if (!PMSG_IS_AUTO(msg))
            status = 0;
    }

    /* If the suspend failed, resume interfaces that did get suspended */
    if (status != 0) {
        msg.event ^= (PM_EVENT_SUSPEND | PM_EVENT_RESUME);
        while (++i < n) {
            intf = udev->actconfig->interface[i];
            usb_resume_interface(udev, intf, msg, 0);
        }

        /* If the suspend succeeded then prevent any more URB submissions
         * and flush any outstanding URBs.
         */
    } else {
        udev->can_submit = 0;
        for (i = 0; i < 16; ++i) {
            usb_hcd_flush_endpoint(udev, udev->ep_out[i]);
            usb_hcd_flush_endpoint(udev, udev->ep_in[i]);
        }
    }

done:
    dev_vdbg(&udev->dev, "%s: status %d\n", __func__, status);
    return status;
}

/**
 * usb_resume_both - resume a USB device and its interfaces
 * @udev: the usb_device to resume
 * @msg: Power Management message describing this state transition
 *
 * This is the central routine for resuming USB devices.  It calls the
 * the resume method for @udev and then calls the resume methods for all
 * the interface drivers in @udev.
 *
 * Autoresume requests originating from a child device or an interface
 * driver may be made without the protection of @udev's device lock, but
 * all other resume calls will hold the lock.  Usbcore will insure that
 * method calls do not arrive during bind, unbind, or reset operations.
 * However drivers must be prepared to handle resume calls arriving at
 * unpredictable times.
 *
 * This routine can run only in process context.
 */
static int usb_resume_both(struct usb_device *udev, pm_message_t msg)
{
    int         status = 0;
    int         i;
    struct usb_interface    *intf;

