OpenNuvoton/M480BSP/Library/USB_Host/src_core/driver.c
    if (udev->state == USB_STATE_NOTATTACHED) {
        status = -ENODEV;
        goto done;
    }
    udev->can_submit = 1;

    /* Resume the device */
    if (udev->state == USB_STATE_SUSPENDED || udev->reset_resume)
        status = usb_resume_device(udev, msg);

    /* Resume the interfaces */
    if (status == 0 && udev->actconfig) {
        for (i = 0; i < udev->actconfig->desc.bNumInterfaces; i++) {
            intf = udev->actconfig->interface[i];
            usb_resume_interface(udev, intf, msg,
                                 udev->reset_resume);
        }
    }
    usb_mark_last_busy(udev);

done:
    dev_vdbg(&udev->dev, "%s: status %d\n", __func__, status);
    if (!status)
        udev->reset_resume = 0;
    return status;
}

static void choose_wakeup(struct usb_device *udev, pm_message_t msg)
{
    int w;

    /* Remote wakeup is needed only when we actually go to sleep.
     * For things like FREEZE and QUIESCE, if the device is already
     * autosuspended then its current wakeup setting is okay.
     */
    if (msg.event == PM_EVENT_FREEZE || msg.event == PM_EVENT_QUIESCE) {
        if (udev->state != USB_STATE_SUSPENDED)
            udev->do_remote_wakeup = 0;
        return;
    }

    /* Enable remote wakeup if it is allowed, even if no interface drivers
     * actually want it.
     */
    w = device_may_wakeup(&udev->dev);

    /* If the device is autosuspended with the wrong wakeup setting,
     * autoresume now so the setting can be changed.
     */
    if (udev->state == USB_STATE_SUSPENDED && w != udev->do_remote_wakeup)
        pm_runtime_resume(&udev->dev);
    udev->do_remote_wakeup = w;
}

/* The device lock is held by the PM core */
int usb_suspend(struct device *dev, pm_message_t msg)
{
    struct usb_device   *udev;

    udev = to_usb_device_by_dev(dev);  // to_usb_device(dev);

    do_unbind_rebind(udev, DO_UNBIND);
    choose_wakeup(udev, msg);
    return usb_suspend_both(udev, msg);
}

/* The device lock is held by the PM core */
int usb_resume(struct device *dev, pm_message_t msg)
{
    struct usb_device   *udev;
    int         status;

    udev = to_usb_device_by_dev(dev);  // to_usb_device(dev);

    /* For PM complete calls, all we do is rebind interfaces */
    if (msg.event == PM_EVENT_ON) {
        if (udev->state != USB_STATE_NOTATTACHED)
            do_unbind_rebind(udev, DO_REBIND);
        status = 0;

        /* For all other calls, take the device back to full power and
         * tell the PM core in case it was autosuspended previously.
         * Unbind the interfaces that will need rebinding later.
         */
    } else {
        status = usb_resume_both(udev, msg);
        if (status == 0) {
            pm_runtime_disable(dev);
            pm_runtime_set_active(dev);
            pm_runtime_enable(dev);
            do_unbind_rebind(udev, DO_REBIND);
        }
    }

    /* Avoid PM error messages for devices disconnected while suspended
     * as we'll display regular disconnect messages just a bit later.
     */
    if (status == -ENODEV || status == -ESHUTDOWN)
        status = 0;
    return status;
}

#endif /* CONFIG_PM */

#ifdef CONFIG_USB_SUSPEND

/**
 * usb_enable_autosuspend - allow a USB device to be autosuspended
 * @udev: the USB device which may be autosuspended
 *
 * This routine allows @udev to be autosuspended.  An autosuspend won't
 * take place until the autosuspend_delay has elapsed and all the other
 * necessary conditions are satisfied.
 *
 * The caller must hold @udev's device lock.
 */
void usb_enable_autosuspend(struct usb_device *udev)
{
    pm_runtime_allow(&udev->dev);
}

/**
 * usb_disable_autosuspend - prevent a USB device from being autosuspended
 * @udev: the USB device which may not be autosuspended
 *
 * This routine prevents @udev from being autosuspended and wakes it up
 * if it is already autosuspended.
 *
 * The caller must hold @udev's device lock.
 */
void usb_disable_autosuspend(struct usb_device *udev)
{
    pm_runtime_forbid(&udev->dev);
}

/**
 * usb_autosuspend_device - delayed autosuspend of a USB device and its interfaces
 * @udev: the usb_device to autosuspend
 *
 * This routine should be called when a core subsystem is finished using
 * @udev and wants to allow it to autosuspend.  Examples would be when
 * @udev's device file in usbfs is closed or after a configuration change.
 *
 * @udev's usage counter is decremented; if it drops to 0 and all the
 * interfaces are inactive then a delayed autosuspend will be attempted.
 * The attempt may fail (see autosuspend_check()).
 *
 * The caller must hold @udev's device lock.
 *
 * This routine can run only in process context.
 */
void usb_autosuspend_device(struct usb_device *udev)
{
    int status;

    usb_mark_last_busy(udev);
    status = pm_runtime_put_sync_autosuspend(&udev->dev);
    dev_vdbg(&udev->dev, "%s: cnt %d -> %d\n",
             __func__, atomic_read(&udev->dev.power.usage_count),
             status);
}

/**
 * usb_autoresume_device - immediately autoresume a USB device and its interfaces
 * @udev: the usb_device to autoresume
 *
 * This routine should be called when a core subsystem wants to use @udev
 * and needs to guarantee that it is not suspended.  No autosuspend will
 * occur until usb_autosuspend_device() is called.  (Note that this will
 * not prevent suspend events originating in the PM core.)  Examples would
 * be when @udev's device file in usbfs is opened or when a remote-wakeup
 * request is received.
 *
 * @udev's usage counter is incremented to prevent subsequent autosuspends.
 * However if the autoresume fails then the usage counter is re-decremented.
 *
 * The caller must hold @udev's device lock.
 *
 * This routine can run only in process context.
 */
int usb_autoresume_device(struct usb_device *udev)
{
    int status;

    status = pm_runtime_get_sync(&udev->dev);
    if (status < 0)
        pm_runtime_put_sync(&udev->dev);
    dev_vdbg(&udev->dev, "%s: cnt %d -> %d\n",
             __func__, atomic_read(&udev->dev.power.usage_count),
             status);
    if (status > 0)
        status = 0;
    return status;
}

/**
 * usb_autopm_put_interface - decrement a USB interface's PM-usage counter
 * @intf: the usb_interface whose counter should be decremented
 *
 * This routine should be called by an interface driver when it is
 * finished using @intf and wants to allow it to autosuspend.  A typical
 * example would be a character-device driver when its device file is
 * closed.
 *
 * The routine decrements @intf's usage counter.  When the counter reaches
 * 0, a delayed autosuspend request for @intf's device is attempted.  The
 * attempt may fail (see autosuspend_check()).
 *
 * This routine can run only in process context.
 */
void usb_autopm_put_interface(struct usb_interface *intf)
{
    struct usb_device   *udev;
    int         status;

    udev = interface_to_usbdev(intf);

    usb_mark_last_busy(udev);
    atomic_dec(&intf->pm_usage_cnt);
    status = pm_runtime_put_sync(&intf->dev);
    dev_vdbg(&intf->dev, "%s: cnt %d -> %d\n",
             __func__, atomic_read(&intf->dev.power.usage_count),
             status);
}

/**
 * usb_autopm_put_interface_async - decrement a USB interface's PM-usage counter
 * @intf: the usb_interface whose counter should be decremented
 *
 * This routine does much the same thing as usb_autopm_put_interface():
 * It decrements @intf's usage counter and schedules a delayed
 * autosuspend request if the counter is <= 0.  The difference is that it
 * does not perform any synchronization; callers should hold a private
 * lock and handle all synchronization issues themselves.
 *
 * Typically a driver would call this routine during an URB's completion
 * handler, if no more URBs were pending.
 *
 * This routine can run in atomic context.
 */
void usb_autopm_put_interface_async(struct usb_interface *intf)
{
    struct usb_device   *udev;
    int         status;

    udev = interface_to_usbdev(intf);

    usb_mark_last_busy(udev);
    atomic_dec(&intf->pm_usage_cnt);
    status = pm_runtime_put(&intf->dev);
    dev_vdbg(&intf->dev, "%s: cnt %d -> %d\n",
             __func__, atomic_read(&intf->dev.power.usage_count),
             status);
}

/**
 * usb_autopm_put_interface_no_suspend - decrement a USB interface's PM-usage counter
 * @intf: the usb_interface whose counter should be decremented
 *
 * This routine decrements @intf's usage counter but does not carry out an
 * autosuspend.
 *
 * This routine can run in atomic context.
 */
void usb_autopm_put_interface_no_suspend(struct usb_interface *intf)
{
    struct usb_device   *udev;

    udev = interface_to_usbdev(intf);

    usb_mark_last_busy(udev);
    atomic_dec(&intf->pm_usage_cnt);
    pm_runtime_put_noidle(&intf->dev);
}

/**
 * usb_autopm_get_interface - increment a USB interface's PM-usage counter
 * @intf: the usb_interface whose counter should be incremented
 *
 * This routine should be called by an interface driver when it wants to
 * use @intf and needs to guarantee that it is not suspended.  In addition,
 * the routine prevents @intf from being autosuspended subsequently.  (Note
 * that this will not prevent suspend events originating in the PM core.)
 * This prevention will persist until usb_autopm_put_interface() is called
 * or @intf is unbound.  A typical example would be a character-device
 * driver when its device file is opened.
 *
 * @intf's usage counter is incremented to prevent subsequent autosuspends.
 * However if the autoresume fails then the counter is re-decremented.
 *
 * This routine can run only in process context.
 */
int usb_autopm_get_interface(struct usb_interface *intf)
{
    int status;

    status = pm_runtime_get_sync(&intf->dev);
    if (status < 0)
        pm_runtime_put_sync(&intf->dev);
    else
        atomic_inc(&intf->pm_usage_cnt);
    dev_vdbg(&intf->dev, "%s: cnt %d -> %d\n",
             __func__, atomic_read(&intf->dev.power.usage_count),
             status);
    if (status > 0)
        status = 0;
    return status;
}

/**
 * usb_autopm_get_interface_async - increment a USB interface's PM-usage counter
 * @intf: the usb_interface whose counter should be incremented
 *
 * This routine does much the same thing as
 * usb_autopm_get_interface(): It increments @intf's usage counter and
 * queues an autoresume request if the device is suspended.  The
 * differences are that it does not perform any synchronization (callers
 * should hold a private lock and handle all synchronization issues
 * themselves), and it does not autoresume the device directly (it only
 * queues a request).  After a successful call, the device may not yet be
 * resumed.
 *
 * This routine can run in atomic context.
 */
int usb_autopm_get_interface_async(struct usb_interface *intf)
{
    int status;

    status = pm_runtime_get(&intf->dev);
    if (status < 0 && status != -EINPROGRESS)
        pm_runtime_put_noidle(&intf->dev);
    else
        atomic_inc(&intf->pm_usage_cnt);
    dev_vdbg(&intf->dev, "%s: cnt %d -> %d\n",
             __func__, atomic_read(&intf->dev.power.usage_count),
             status);
    if (status > 0 || status == -EINPROGRESS)
        status = 0;
    return status;
}

/**
 * usb_autopm_get_interface_no_resume - increment a USB interface's PM-usage counter
 * @intf: the usb_interface whose counter should be incremented
 *
 * This routine increments @intf's usage counter but does not carry out an
 * autoresume.
 *
 * This routine can run in atomic context.
 */
void usb_autopm_get_interface_no_resume(struct usb_interface *intf)
{
    struct usb_device   *udev;

    udev = interface_to_usbdev(intf);

    usb_mark_last_busy(udev);
    atomic_inc(&intf->pm_usage_cnt);
    pm_runtime_get_noresume(&intf->dev);
}

