OpenNuvoton/M480BSP/Library/USB_Host/src_core/driver.c
/* Internal routine to check whether we may autosuspend a device. */
static int autosuspend_check(struct usb_device *udev)
{
    int         w, i;
    struct usb_interface    *intf;

    /* Fail if autosuspend is disabled, or any interfaces are in use, or
     * any interface drivers require remote wakeup but it isn't available.
     */
    w = 0;
    if (udev->actconfig) {
        for (i = 0; i < udev->actconfig->desc.bNumInterfaces; i++) {
            intf = udev->actconfig->interface[i];

            /* We don't need to check interfaces that are
             * disabled for runtime PM.  Either they are unbound
             * or else their drivers don't support autosuspend
             * and so they are permanently active.
             */
            if (intf->dev.power.disable_depth)
                continue;
            if (atomic_read(&intf->dev.power.usage_count) > 0)
                return -EBUSY;
            w |= intf->needs_remote_wakeup;

            /* Don't allow autosuspend if the device will need
             * a reset-resume and any of its interface drivers
             * doesn't include support or needs remote wakeup.
             */
            if (udev->quirks & USB_QUIRK_RESET_RESUME) {
                struct usb_driver *driver;

                driver = to_usb_driver_by_devdrv(intf->dev.driver);  // to_usb_driver(intf->dev.driver);
                if (!driver->reset_resume ||
                        intf->needs_remote_wakeup)
                    return -EOPNOTSUPP;
            }
        }
    }
    if (w && !device_can_wakeup(&udev->dev)) {
        USB_debug("remote wakeup needed for autosuspend\n");
        return -EOPNOTSUPP;
    }
    udev->do_remote_wakeup = w;
    return 0;
}

int usb_runtime_suspend(struct device *dev)
{
    struct usb_device   *udev;
    int         status;

    udev = to_usb_device_by_dev(dev);  // to_usb_device(dev);

    /* A USB device can be suspended if it passes the various autosuspend
     * checks.  Runtime suspend for a USB device means suspending all the
     * interfaces and then the device itself.
     */
    if (autosuspend_check(udev) != 0)
        return -EAGAIN;

    status = usb_suspend_both(udev, PMSG_AUTO_SUSPEND);

    /* Allow a retry if autosuspend failed temporarily */
    if (status == -EAGAIN || status == -EBUSY)
        usb_mark_last_busy(udev);

    /* The PM core reacts badly unless the return code is 0,
     * -EAGAIN, or -EBUSY, so always return -EBUSY on an error.
     */
    if (status != 0)
        return -EBUSY;
    return status;
}

int usb_runtime_resume(struct device *dev)
{
    struct usb_device   *udev;
    int         status;

    udev = to_usb_device_by_dev(dev);  // to_usb_device(dev);

    /* Runtime resume for a USB device means resuming both the device
     * and all its interfaces.
     */
    status = usb_resume_both(udev, PMSG_AUTO_RESUME);
    return status;
}

int usb_runtime_idle(struct device *dev)
{
    struct usb_device   *udev;

    udev = to_usb_device_by_dev(dev); // to_usb_device(dev);

    /* An idle USB device can be suspended if it passes the various
     * autosuspend checks.
     */
    if (autosuspend_check(udev) == 0)
        pm_runtime_autosuspend(dev);
    return 0;
}

int usb_set_usb2_hardware_lpm(struct usb_device *udev, int enable)
{
    struct usb_hcd *hcd;
    int ret = -EPERM;

    hcd = bus_to_hcd(udev->bus);

    if (hcd->driver->set_usb2_hw_lpm) {
        ret = hcd->driver->set_usb2_hw_lpm(hcd, udev, enable);
        if (!ret)
            udev->usb2_hw_lpm_enabled = enable;
    }

    return ret;
}

#endif /* CONFIG_USB_SUSPEND */

struct bus_type usb_bus_type = {
    "usb\0",
    usb_device_match
};

/// @endcond HIDDEN_SYMBOLS

